Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S2B.atdf
        <register caption="Transmit Next Pointer Register" name="DACC_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="DACC_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="DACC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="DACC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="DACC_MR__TRGEN">
        <value caption="External trigger mode disabled. DACC in free-running mode." name="DIS" value="0"/>
        <value caption="External trigger mode enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__TRGSEL">
        <value caption="External trigger" name="TRGSEL0" value="0x0"/>
        <value caption="TIO Output of the Timer Counter Channel 0" name="TRGSEL1" value="0x1"/>
        <value caption="TIO Output of the Timer Counter Channel 1" name="TRGSEL2" value="0x2"/>
        <value caption="TIO Output of the Timer Counter Channel 2" name="TRGSEL3" value="0x3"/>
        <value caption="PWM Event Line 0" name="TRGSEL4" value="0x4"/>
        <value caption="PWM Event Line 1" name="TRGSEL5" value="0x5"/>
      </value-group>
      <value-group caption="" name="DACC_MR__WORD">
        <value caption="Half-word transfer" name="HALF" value="0"/>
        <value caption="Word transfer" name="WORD" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__USER_SEL">
        <value caption="Channel 0" name="CHANNEL0" value="0"/>
        <value caption="Channel 1" name="CHANNEL1" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__TAG">
        <value caption="Tag selection mode disabled. Using USER_SEL to select the channel for the conversion." name="DIS" value="0"/>
        <value caption="Tag selection mode enabled" name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__MAXS">
        <value caption="Normal mode" name="NORMAL" value="0"/>
        <value caption="Maximum speed mode enabled" name="MAXIMUM" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__STARTUP">
        <value caption="0 periods of peripheral clock" name="_0" value="0x0"/>
        <value caption="8 periods of peripheral clock" name="_8" value="0x1"/>
        <value caption="16 periods of peripheral clock" name="_16" value="0x2"/>
        <value caption="24 periods of peripheral clock" name="_24" value="0x3"/>
        <value caption="64 periods of peripheral clock" name="_64" value="0x4"/>
        <value caption="80 periods of peripheral clock" name="_80" value="0x5"/>
        <value caption="96 periods of peripheral clock" name="_96" value="0x6"/>
        <value caption="112 periods of peripheral clock" name="_112" value="0x7"/>
        <value caption="512 periods of peripheral clock" name="_512" value="0x8"/>
        <value caption="576 periods of peripheral clock" name="_576" value="0x9"/>
        <value caption="640 periods of peripheral clock" name="_640" value="0xA"/>
        <value caption="704 periods of peripheral clock" name="_704" value="0xB"/>
        <value caption="768 periods of peripheral clock" name="_768" value="0xC"/>
        <value caption="832 periods of peripheral clock" name="_832" value="0xD"/>
        <value caption="896 periods of peripheral clock" name="_896" value="0xE"/>
        <value caption="960 periods of peripheral clock" name="_960" value="0xF"/>
        <value caption="1024 periods of peripheral clock" name="_1024" value="0x10"/>
        <value caption="1088 periods of peripheral clock" name="_1088" value="0x11"/>
        <value caption="1152 periods of peripheral clock" name="_1152" value="0x12"/>
        <value caption="1216 periods of peripheral clock" name="_1216" value="0x13"/>
        <value caption="1280 periods of peripheral clock" name="_1280" value="0x14"/>
        <value caption="1344 periods of peripheral clock" name="_1344" value="0x15"/>
        <value caption="1408 periods of peripheral clock" name="_1408" value="0x16"/>
        <value caption="1472 periods of peripheral clock" name="_1472" value="0x17"/>
        <value caption="1536 periods of peripheral clock" name="_1536" value="0x18"/>
        <value caption="1600 periods of peripheral clock" name="_1600" value="0x19"/>
        <value caption="1664 periods of peripheral clock" name="_1664" value="0x1A"/>
        <value caption="1728 periods of peripheral clock" name="_1728" value="0x1B"/>
        <value caption="1792 periods of peripheral clock" name="_1792" value="0x1C"/>
        <value caption="1856 periods of peripheral clock" name="_1856" value="0x1D"/>
        <value caption="1920 periods of peripheral clock" name="_1920" value="0x1E"/>
        <value caption="1984 periods of peripheral clock" name="_1984" value="0x1F"/>
        <value caption="2048 periods of peripheral clock" name="_2048" value="0x20"/>
        <value caption="2112 periods of peripheral clock" name="_2112" value="0x21"/>
        <value caption="2176 periods of peripheral clock" name="_2176" value="0x22"/>
        <value caption="2240 periods of peripheral clock" name="_2240" value="0x23"/>
        <value caption="2304 periods of peripheral clock" name="_2304" value="0x24"/>
        <value caption="2368 periods of peripheral clock" name="_2368" value="0x25"/>
        <value caption="2432 periods of peripheral clock" name="_2432" value="0x26"/>
        <value caption="2496 periods of peripheral clock" name="_2496" value="0x27"/>
        <value caption="2560 periods of peripheral clock" name="_2560" value="0x28"/>
        <value caption="2624 periods of peripheral clock" name="_2624" value="0x29"/>
        <value caption="2688 periods of peripheral clock" name="_2688" value="0x2A"/>
        <value caption="2752 periods of peripheral clock" name="_2752" value="0x2B"/>
        <value caption="2816 periods of peripheral clock" name="_2816" value="0x2C"/>
        <value caption="2880 periods of peripheral clock" name="_2880" value="0x2D"/>
        <value caption="2944 periods of peripheral clock" name="_2944" value="0x2E"/>
        <value caption="3008 periods of peripheral clock" name="_3008" value="0x2F"/>
        <value caption="3072 periods of peripheral clock" name="_3072" value="0x30"/>
        <value caption="3136 periods of peripheral clock" name="_3136" value="0x31"/>
        <value caption="3200 periods of peripheral clock" name="_3200" value="0x32"/>
        <value caption="3264 periods of peripheral clock" name="_3264" value="0x33"/>
        <value caption="3328 periods of peripheral clock" name="_3328" value="0x34"/>
        <value caption="3392 periods of peripheral clock" name="_3392" value="0x35"/>
        <value caption="3456 periods of peripheral clock" name="_3456" value="0x36"/>
        <value caption="3520 periods of peripheral clock" name="_3520" value="0x37"/>
        <value caption="3584 periods of peripheral clock" name="_3584" value="0x38"/>
        <value caption="3648 periods of peripheral clock" name="_3648" value="0x39"/>
        <value caption="3712 periods of peripheral clock" name="_3712" value="0x3A"/>
        <value caption="3776 periods of peripheral clock" name="_3776" value="0x3B"/>
        <value caption="3840 periods of peripheral clock" name="_3840" value="0x3C"/>
        <value caption="3904 periods of peripheral clock" name="_3904" value="0x3D"/>
        <value caption="3968 periods of peripheral clock" name="_3968" value="0x3E"/>
        <value caption="4032 periods of peripheral clock" name="_4032" value="0x3F"/>
      </value-group>
      <value-group caption="" name="DACC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x444143"/>
      </value-group>
    </module>
    <module caption="Embedded Flash Controller" name="EFC" version="6450X">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Flash Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Flash Access Mode" mask="0x01000000" name="FAM"/>
          <bitfield caption="Code Loop Optimization Enable" mask="0x04000000" name="CLOE"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status (cleared when Flash is busy)" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status (cleared on read or by writing EEFC_FCR)" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status (cleared on read)" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Flash Error Status (cleared when a programming operation starts)" mask="0x00000008" name="FLERR"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
      </register-group>
      <value-group caption="" name="EEFC_FCR__FCMD">
        <value caption="Get Flash descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase page and write page" name="EWP" value="0x03"/>
        <value caption="Erase page and write page then lock" name="EWPL" value="0x04"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Erase pages" name="EPA" value="0x07"/>
        <value caption="Set lock bit" name="SLB" value="0x08"/>
        <value caption="Clear lock bit" name="CLB" value="0x09"/>
        <value caption="Get lock bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM bit" name="GGPB" value="0x0D"/>
        <value caption="Start read unique identifier" name="STUI" value="0x0E"/>
        <value caption="Stop read unique identifier" name="SPUI" value="0x0F"/>
        <value caption="Get CALIB bit" name="GCALB" value="0x10"/>
        <value caption="Erase sector" name="ES" value="0x11"/>
        <value caption="Write user signature" name="WUS" value="0x12"/>
        <value caption="Erase user signature" name="EUS" value="0x13"/>
        <value caption="Start read user signature" name="STUS" value="0x14"/>
        <value caption="Stop read user signature" name="SPUS" value="0x15"/>
      </value-group>
