Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S2B.atdf
        <register caption="Transfer Control Register" name="PWM_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="PWM_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="PWM_CLK__DIVA">
        <value caption="CLKA clock is turned off" name="CLKA_POFF" value="0"/>
        <value caption="CLKA clock is clock selected by PREA" name="PREA" value="1"/>
      </value-group>
      <value-group caption="" name="PWM_CLK__PREA">
        <value caption="Peripheral clock" name="CLK" value="0x0"/>
        <value caption="Peripheral clock/2" name="CLK_DIV2" value="0x1"/>
        <value caption="Peripheral clock/4" name="CLK_DIV4" value="0x2"/>
        <value caption="Peripheral clock/8" name="CLK_DIV8" value="0x3"/>
        <value caption="Peripheral clock/16" name="CLK_DIV16" value="0x4"/>
        <value caption="Peripheral clock/32" name="CLK_DIV32" value="0x5"/>
        <value caption="Peripheral clock/64" name="CLK_DIV64" value="0x6"/>
        <value caption="Peripheral clock/128" name="CLK_DIV128" value="0x7"/>
        <value caption="Peripheral clock/256" name="CLK_DIV256" value="0x8"/>
        <value caption="Peripheral clock/512" name="CLK_DIV512" value="0x9"/>
        <value caption="Peripheral clock/1024" name="CLK_DIV1024" value="0xA"/>
      </value-group>
      <value-group caption="" name="PWM_CLK__DIVB">
        <value caption="CLKB clock is turned off" name="CLKB_POFF" value="0"/>
        <value caption="CLKB clock is clock selected by PREB" name="PREB" value="1"/>
      </value-group>
      <value-group caption="" name="PWM_CLK__PREB">
        <value caption="Peripheral clock" name="CLK" value="0x0"/>
        <value caption="Peripheral clock/2" name="CLK_DIV2" value="0x1"/>
        <value caption="Peripheral clock/4" name="CLK_DIV4" value="0x2"/>
        <value caption="Peripheral clock/8" name="CLK_DIV8" value="0x3"/>
        <value caption="Peripheral clock/16" name="CLK_DIV16" value="0x4"/>
        <value caption="Peripheral clock/32" name="CLK_DIV32" value="0x5"/>
        <value caption="Peripheral clock/64" name="CLK_DIV64" value="0x6"/>
        <value caption="Peripheral clock/128" name="CLK_DIV128" value="0x7"/>
        <value caption="Peripheral clock/256" name="CLK_DIV256" value="0x8"/>
        <value caption="Peripheral clock/512" name="CLK_DIV512" value="0x9"/>
        <value caption="Peripheral clock/1024" name="CLK_DIV1024" value="0xA"/>
      </value-group>
      <value-group caption="" name="PWM_SCM__UPDM">
        <value caption="Manual write of double buffer registers and manual update of synchronous channels" name="MODE0" value="0x0"/>
        <value caption="Manual write of double buffer registers and automatic update of synchronous channels" name="MODE1" value="0x1"/>
        <value caption="Automatic write of duty-cycle update registers by the Peripheral DMA Controller and automatic update of synchronous channels" name="MODE2" value="0x2"/>
      </value-group>
      <value-group caption="" name="PWM_WPCR__WPCMD">
        <value caption="Disables the software write protection of the register groups of which the bit WPRGx is at '1'." name="DISABLE_SW_PROT" value="0x0"/>
        <value caption="Enables the software write protection of the register groups of which the bit WPRGx is at '1'." name="ENABLE_SW_PROT" value="0x1"/>
        <value caption="Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface." name="ENABLE_HW_PROT" value="0x2"/>
      </value-group>
      <value-group caption="" name="PWM_WPCR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0" name="PASSWD" value="0x50574D"/>
      </value-group>
      <value-group caption="" name="PWM_CMR0__CPRE">
        <value caption="Peripheral clock" name="MCK" value="0x0"/>
        <value caption="Peripheral clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Peripheral clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Peripheral clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Peripheral clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Peripheral clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Peripheral clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Peripheral clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Peripheral clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Peripheral clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Peripheral clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CMR1__CPRE">
        <value caption="Peripheral clock" name="MCK" value="0x0"/>
        <value caption="Peripheral clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Peripheral clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Peripheral clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Peripheral clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Peripheral clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Peripheral clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Peripheral clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Peripheral clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Peripheral clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Peripheral clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CMR2__CPRE">
        <value caption="Peripheral clock" name="MCK" value="0x0"/>
        <value caption="Peripheral clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Peripheral clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Peripheral clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Peripheral clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Peripheral clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Peripheral clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Peripheral clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Peripheral clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Peripheral clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Peripheral clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
