Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S2B.atdf
      <value-group caption="" name="SUPC_SR__SMS">
        <value caption="No supply monitor detection since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one supply monitor detection since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMOS">
        <value caption="The supply monitor detected VDDIO higher than its threshold at its last measurement." name="HIGH" value="0"/>
        <value caption="The supply monitor detected VDDIO lower than its threshold at its last measurement." name="LOW" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__OSCSEL">
        <value caption="The slow clock, SLCK, is generated by the embedded 32 kHz RC oscillator." name="RC" value="0"/>
        <value caption="The slow clock, SLCK, is generated by the 32 kHz crystal oscillator." name="CRYST" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__LPDBCS0">
        <value caption="No wake-up due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one wake-up due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__LPDBCS1">
        <value caption="No wake-up due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one wake-up due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS0">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS1">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS2">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS3">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS4">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS5">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS6">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS7">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS8">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS9">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS10">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
