Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S2B.atdf
      <value-group caption="" name="US_MR__NBSTOP">
        <value caption="1 stop bit" name="_1_BIT" value="0x0"/>
        <value caption="1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)" name="_1_5_BIT" value="0x1"/>
        <value caption="2 stop bits" name="_2_BIT" value="0x2"/>
      </value-group>
      <value-group caption="" name="US_MR__CHMODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic Echo. Receiver input is connected to the TXD pin." name="AUTOMATIC" value="0x1"/>
        <value caption="Local Loopback. Transmitter output is connected to the Receiver Input." name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote Loopback. RXD pin is internally connected to the TXD pin." name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
      <value-group caption="" name="US_MAN__TX_PP">
        <value caption="The preamble is composed of '1's" name="ALL_ONE" value="0x0"/>
        <value caption="The preamble is composed of '0's" name="ALL_ZERO" value="0x1"/>
        <value caption="The preamble is composed of '01's" name="ZERO_ONE" value="0x2"/>
        <value caption="The preamble is composed of '10's" name="ONE_ZERO" value="0x3"/>
      </value-group>
      <value-group caption="" name="US_MAN__RX_PP">
        <value caption="The preamble is composed of '1's" name="ALL_ONE" value="0x0"/>
        <value caption="The preamble is composed of '0's" name="ALL_ZERO" value="0x1"/>
        <value caption="The preamble is composed of '01's" name="ZERO_ONE" value="0x2"/>
        <value caption="The preamble is composed of '10's" name="ONE_ZERO" value="0x3"/>
      </value-group>
      <value-group caption="" name="US_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x555341"/>
      </value-group>
    </module>
    <module caption="Watchdog Timer" name="WDT" version="6080I">
      <register-group name="WDT">
        <register caption="Control Register" name="WDT_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Watchdog Restart" mask="0x00000001" name="WDRSTT"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="WDT_CR__KEY"/>
        </register>
        <register caption="Mode Register" name="WDT_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Watchdog Counter Value" mask="0x00000FFF" name="WDV"/>
          <bitfield caption="Watchdog Fault Interrupt Enable" mask="0x00001000" name="WDFIEN"/>
          <bitfield caption="Watchdog Reset Enable" mask="0x00002000" name="WDRSTEN"/>
          <bitfield caption="Watchdog Reset Processor" mask="0x00004000" name="WDRPROC"/>
          <bitfield caption="Watchdog Disable" mask="0x00008000" name="WDDIS"/>
          <bitfield caption="Watchdog Delta Value" mask="0x0FFF0000" name="WDD"/>
          <bitfield caption="Watchdog Debug Halt" mask="0x10000000" name="WDDBGHLT"/>
          <bitfield caption="Watchdog Idle Halt" mask="0x20000000" name="WDIDLEHLT"/>
        </register>
        <register caption="Status Register" name="WDT_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="Watchdog Underflow (cleared on read)" mask="0x00000001" name="WDUNF"/>
          <bitfield caption="Watchdog Error (cleared on read)" mask="0x00000002" name="WDERR"/>
        </register>
      </register-group>
      <value-group caption="" name="WDT_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
    </module>
    <module name="FUSES" version="1">
      <register-group caption="GPNVM Bits" name="GPNVMBITS">
        <register caption="GPNVM Bits" name="GPNVMBITS" offset="0x0" rw="RW" size="1">
          <bitfield caption="Security Bit" mask="0x00000001" name="SECURITY_BIT" rw="R"/>
          <bitfield caption="Boot Mode Selection" mask="0x00000002" name="BOOT_MODE"/>
        </register>
      </register-group>
    </module>
    <module name="LOCKBIT" version="1">
      <register-group name="LOCKBIT">
        <register caption="Lock Bits" name="LOCKBIT" offset="0x0" rw="RW" size="2">
          <bitfield caption="Lock Region 0" mask="0x00000001" name="LOCK_REGION_0"/>
          <bitfield caption="Lock Region 1" mask="0x00000002" name="LOCK_REGION_1"/>
          <bitfield caption="Lock Region 2" mask="0x00000004" name="LOCK_REGION_2"/>
          <bitfield caption="Lock Region 3" mask="0x00000008" name="LOCK_REGION_3"/>
          <bitfield caption="Lock Region 4" mask="0x00000010" name="LOCK_REGION_4"/>
          <bitfield caption="Lock Region 5" mask="0x00000020" name="LOCK_REGION_5"/>
          <bitfield caption="Lock Region 6" mask="0x00000040" name="LOCK_REGION_6"/>
          <bitfield caption="Lock Region 7" mask="0x00000080" name="LOCK_REGION_7"/>
          <bitfield caption="Lock Region 8" mask="0x00000100" name="LOCK_REGION_8"/>
          <bitfield caption="Lock Region 9" mask="0x00000200" name="LOCK_REGION_9"/>
          <bitfield caption="Lock Region 10" mask="0x00000400" name="LOCK_REGION_10"/>
          <bitfield caption="Lock Region 11" mask="0x00000800" name="LOCK_REGION_11"/>
          <bitfield caption="Lock Region 12" mask="0x00001000" name="LOCK_REGION_12"/>
          <bitfield caption="Lock Region 13" mask="0x00002000" name="LOCK_REGION_13"/>
          <bitfield caption="Lock Region 14" mask="0x00004000" name="LOCK_REGION_14"/>
          <bitfield caption="Lock Region 15" mask="0x00008000" name="LOCK_REGION_15"/>
        </register>
      </register-group>
    </module>
  <module name="SystemControl" caption="System Control Registers">
            <register-group name="SystemControl" caption="System Control Registers">
                <register offset="0x00000008" size="4" name="ACTLR" initval="0" caption="Auxiliary Control Register,">
                    <bitfield mask="0x00000001" name="DISMCYCINT" caption="Disables interruption of multi-cycle instructions."/>
                    <bitfield mask="0x00000002" name="DISDEFWBUF" caption="Disables write buffer use during default memory map accesses."/>
                    <bitfield mask="0x00000004" name="DISFOLD" caption="Disables folding of IT instructions."/>
                </register>
                <register offset="0x00000d00" size="4" name="CPUID" initval="0x410FC240" caption="CPUID Base Register">
                    <bitfield mask="0x0000000f" name="REVISION" caption="Indicates patch release: 0x0 = Patch 0"/>
                    <bitfield mask="0x0000fff0" name="PARTNO" caption="Indicates part number"/>
                    <bitfield mask="0x00f00000" name="VARIANT" caption="Indicates processor revision: 0x2 = Revision 2"/>
                    <bitfield mask="0xff000000" name="IMPLEMENTER" caption="Implementer code"/>
                </register>
                <register offset="0x00000d04" size="4" name="ICSR" initval="0" caption="Interrupt Control and State Register">
                    <bitfield mask="0x000001ff" name="VECTACTIVE" caption="Active exception number"/>
                    <bitfield mask="0x00000800" name="RETTOBASE" values="RETTOBASE" caption="no description available"/>
                    <bitfield mask="0x0003f000" name="VECTPENDING" caption="Exception number of the highest priority pending enabled exception"/>
                    <bitfield mask="0x00400000" name="ISRPENDING" caption="no description available"/>
                    <bitfield mask="0x00800000" name="ISRPREEMPT" values="ISRPREEMPT" caption="no description available"/>
                    <bitfield mask="0x02000000" name="PENDSTCLR" values="PENDSTCLR" caption="no description available"/>
                    <bitfield mask="0x04000000" name="PENDSTSET" values="PENDSTSET" caption="no description available"/>
                    <bitfield mask="0x08000000" name="PENDSVCLR" values="PENDSVCLR" caption="no description available"/>
                    <bitfield mask="0x10000000" name="PENDSVSET" values="PENDSVSET" caption="no description available"/>
                    <bitfield mask="0x80000000" name="NMIPENDSET" values="NMIPENDSET" caption="no description available"/>
                </register>
